; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	thermograph4 - mode
	infrared2 - mode
	infrared6 - mode
	thermograph8 - mode
	image7 - mode
	image3 - mode
	image5 - mode
	image1 - mode
	spectrograph0 - mode
	GroundStation2 - direction
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image5)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation5)
	(supports instrument1 spectrograph0)
	(supports instrument1 image5)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument2 thermograph8)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 infrared2)
	(supports instrument3 image1)
	(supports instrument3 infrared6)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 thermograph8)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared6)
	(supports instrument5 image5)
	(calibration_target instrument5 Star1)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 thermograph8)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation5)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument7 image3)
	(supports instrument7 image7)
	(supports instrument7 image5)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 image5)
	(supports instrument8 thermograph4)
	(calibration_target instrument8 GroundStation5)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star1)
)
(:goal (and
	(pointing satellite2 Star0)
	(have_image Phenomenon6 infrared2)
	(have_image Phenomenon6 thermograph8)
	(have_image Phenomenon6 image1)
	(have_image Planet7 infrared6)
	(have_image Planet7 image5)
	(have_image Star8 infrared2)
	(have_image Star8 thermograph8)
	(have_image Phenomenon9 infrared2)
	(have_image Phenomenon9 spectrograph0)
	(have_image Phenomenon9 thermograph8)
	(have_image Star10 thermograph4)
	(have_image Star10 image7)
	(have_image Star11 thermograph4)
))

)

; plan
1. (turn_to satellite3 groundstation4 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 groundstation4)
   goals met: 0 of 14
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 14
3. (calibrate satellite3 instrument7 groundstation4)
   added: (calibrated instrument7)
   goals met: 0 of 14
4. (turn_to satellite3 planet7 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 planet7)
   goals met: 0 of 14
5. (turn_to satellite2 groundstation3 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 14
6. (turn_to satellite0 groundstation5 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation5)
   goals met: 0 of 14
7. (take_image satellite3 planet7 instrument7 image5)
   added: (have_image planet7 image5)
   goals met: 1 of 14
8. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 1 of 14
9. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 14
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 14
11. (calibrate satellite2 instrument6 groundstation3)
   added: (calibrated instrument6)
   goals met: 1 of 14
12. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 1 of 14
13. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 1 of 14
14. (turn_to satellite0 phenomenon6 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon6)
   goals met: 1 of 14
15. (take_image satellite0 phenomenon6 instrument0 image1)
   added: (have_image phenomenon6 image1)
   goals met: 2 of 14
16. (turn_to satellite0 phenomenon9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 14
17. (take_image satellite0 phenomenon9 instrument0 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 3 of 14
18. (turn_to satellite1 planet7 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet7)
   goals met: 3 of 14
19. (take_image satellite1 planet7 instrument3 infrared6)
   added: (have_image planet7 infrared6)
   goals met: 4 of 14
20. (turn_to satellite2 phenomenon6 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 phenomenon6)
   goals met: 4 of 14
21. (take_image satellite2 phenomenon6 instrument6 infrared2)
   added: (have_image phenomenon6 infrared2)
   goals met: 5 of 14
22. (take_image satellite2 phenomenon6 instrument6 thermograph8)
   added: (have_image phenomenon6 thermograph8)
   goals met: 6 of 14
23. (turn_to satellite2 phenomenon9 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon9)
   goals met: 6 of 14
24. (take_image satellite2 phenomenon9 instrument6 infrared2)
   added: (have_image phenomenon9 infrared2)
   goals met: 7 of 14
25. (take_image satellite2 phenomenon9 instrument6 thermograph8)
   added: (have_image phenomenon9 thermograph8)
   goals met: 8 of 14
26. (turn_to satellite2 star8 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star8)
   goals met: 8 of 14
27. (take_image satellite2 star8 instrument6 infrared2)
   added: (have_image star8 infrared2)
   goals met: 9 of 14
28. (take_image satellite2 star8 instrument6 thermograph8)
   added: (have_image star8 thermograph8)
   goals met: 10 of 14
29. (turn_to satellite2 star0 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star0)
   goals met: 11 of 14
30. (turn_to satellite3 star10 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 star10)
   goals met: 11 of 14
31. (take_image satellite3 star10 instrument7 image7)
   added: (have_image star10 image7)
   goals met: 12 of 14
32. (switch_off instrument7 satellite3)
   deleted: (power_on instrument7)
   added: (power_avail satellite3)
   goals met: 12 of 14
33. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 12 of 14
34. (turn_to satellite3 groundstation4 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 groundstation4)
   goals met: 12 of 14
35. (calibrate satellite3 instrument8 groundstation4)
   added: (calibrated instrument8)
   goals met: 12 of 14
36. (turn_to satellite3 star10 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star10)
   goals met: 12 of 14
37. (take_image satellite3 star10 instrument8 thermograph4)
   added: (have_image star10 thermograph4)
   goals met: 13 of 14
38. (turn_to satellite3 star11 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 star11)
   goals met: 13 of 14
39. (take_image satellite3 star11 instrument8 thermograph4)
   added: (have_image star11 thermograph4)
   goals met: 14 of 14
